IDEA Open Model
HingeElement1D.HingeTypeZ Property
Compatible with IDEA StatiCa v 10.1
 Hinge type in dirrection Z
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public HingeTypeInDirrection HingeTypeZ { get; set; }
Public Property HingeTypeZ As HingeTypeInDirrection
	Get
	Set
public:
property HingeTypeInDirrection HingeTypeZ {
	HingeTypeInDirrection get ();
	void set (HingeTypeInDirrection value);
}
Property Value
Type: HingeTypeInDirrection
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace